<template>
  <div class="app-copyright">
    <NavBar />
    <div class="app-copyright__container">
      <h1>版权协议</h1>
      <p>
        为了保持文章质量，并保持互联网的开放共享精神，保持页面流量的稳定，综合考虑下本站的所有原创文章均采用cc协议中比较严格的
        <a
          target="_blank"
          href="https://creativecommons.org/licenses/by-nc-nd/4.0/deed.zh"
          >署名-非商业性使用-禁止演绎 4.0 国际</a
        >
        标准。这篇文章主要想能够更加清楚明白的介绍本站的协议标准和要求。方便你合理的使用本站的文章。
      </p>
      <p>
        本站无广告嵌入和商业行为。违反协议的行为不仅会损害原作者的创作热情，而且会影响整个版权环境。强烈呼吁你能够在转载时遵守协议。遵守协议的行为几乎不会对你的目标产生负面影响，鼓励创作环境是每个创作者的期望。
      </p>
      <h2>博客的分类介绍</h2>
      <p>
        <b>经验分享</b
        >包含原创内容，原创内容的非商用转载必须为完整转载且标注出处的<b>带有超链接功能的完整url链接</b>（<b
          >需能点击</b
        >
        ）或<code>访问原文</code>之类字样的超链接。
      </p>
      <p>
        <b>转载内容</b
        >为转载内容，均标注了出处。建议使用原链接打开，尊重原作者。所有转载内容尽可能为完整转载（如果有部分内容有问题可能会由部分删减和补充）并进行样式调整以适合本博客。如果转载该部分内容需要联系原作者。
      </p>
      <h2>你可以做什么？</h2>
      <p>
        只要你遵守本页的许可，你可以自由地共享文章的内容 —
        在任何媒介以任何形式复制、发行本作品。并且无需通知作者。
      </p>
      <h2>你需要遵守什么样的许可？</h2>
      <h3>署名</h3>
      <p>
        你必须标注内容的来源，你需要在文章开头部分（或者明显位置）标注原文章链接（建议使用超链接提升阅读体验）。
      </p>
      <h3>禁止商用</h3>
      <p>
        本站内容免费向互联网所有用户提供，分享本站文章时禁止商业性使用、禁止在转载页面中插入广告（例如谷歌广告、百度广告）、禁止阅读的拦截行为（例如关注公众号、下载App后观看文章）。
      </p>
      <h3>禁止演绎</h3>
      <ul>
        <li>
          <p>
            分享全部内容（无修改）<br />你需要在文章开头部分（或者明显位置）标注原文章链接（建议使用超链接）
          </p>
        </li>
        <li>
          <p>
            分享部分截取内容或者衍生创作<br />目前本站全部原创文章的衍生品禁止公开分享和分发。如有更好的修改建议，可以在对应文章下留言。如有衍生创作需求，可以在评论中联系。
          </p>
        </li>
      </ul>
      <h2>什么内容会被版权保护</h2>
      <p>包括但不限于：</p>
      <ul>
        <li>文章封面图片</li>
        <li>文章标题和正文</li>
        <li>站点图片素材（不含主题自带素材）</li>
      </ul>
      <h2>例外情况</h2>
      <p>
        本着友好互相进步的原则，被本站友链收录的博客允许博客文章内容的衍生品的分享和分发，但仍需标注出处。
      </p>
      <p>
        本着互联网开放精神，你可以在博客文章下方留言要求授权博文的衍生品的分享和分发，标注你的网站地址。
      </p>
      <p>本博客专属的logo仅本博客内使用，禁止共享、分发到其他页面</p>
      <h2>网站源代码协议</h2>
      <p>
        本着开源使人类进步的原则，本博客相关的源码（包含前后端代码）已上传本人github仓库<a
          href="https://www.github.com/mecci1999"
          target="_blank"
          >点击访问</a
        >，欢迎大家访问下载，别忘了点个星，毕竟博主花了不少的心血和掉了不少的头发。
      </p>
    </div>
    <AppFooter />
  </div>
</template>

<script lang="ts" setup>
import NavBar from '@/components/navBar/index.vue';
import AppFooter from '@/components/footer/index.vue';
import { onMounted } from 'vue';

onMounted(() => {
  window.scrollTo({ top: 0 });
});
</script>

<style lang="scss">
@import './index.scss';
</style>
